docs/diagrams/include_diagram.mmd
flowchart
    subgraph C_0009392701334512935369[src]
    subgraph C_0000376844742298738572[serverModule]
    C_0004930444100045331493[server.h]
    C_0014776125144863485891[serverhandler.h]
    C_0014526408463163538724[server.cpp]
    C_0002802959985742540062[serverhandler.cpp]
    end
    subgraph C_0007249139127462911352[requestModule]
    C_0004662975987075955962[RequestManager.h]
    subgraph C_0001482322031337363986[Requests]
    C_0000683983954371703321[Request.h]
    C_0009705104522813573766[LoginRequest.h]
    C_0002027120791438508115[GetAccountNumberRequest.h]
    C_0010044431027817489945[GetBalanceRequest.h]
    C_0006672437125610379356[GetTransactionsHistoryRequest.h]
    C_0008063967914262038647[MakeTransactionRequest.h]
    C_0009014951225837961074[GetDatabaseRequest.h]
    C_0012389142519446737106[CreateNewUserRequest.h]
    C_0017998885070914382401[DeleteUserRequest.h]
    C_0011687987665606014223[UpdateUserRequest.h]
    C_0011066283835893554674[UserInitRequest.h]
    C_0000415219272604096448[UpdateEmailRequest.h]
    C_0015919083400246773521[UpdatePasswordRequest.h]
    end
    end
    subgraph C_0006877198409089665649[dbModule]
    C_0005021643397729925023[db.h]
    C_0012871275894220828006[dbresult.h]
    C_0016013798473120276547[dbresult.cpp]
    C_0010016149012892003898[db.cpp]
    end
    end
    C_0004930444100045331493 --> C_0014776125144863485891
    C_0014776125144863485891 --> C_0004662975987075955962
    C_0014526408463163538724 --> C_0004930444100045331493
    C_0002802959985742540062 --> C_0014776125144863485891
    C_0004662975987075955962 --> C_0000683983954371703321
    C_0004662975987075955962 --> C_0009705104522813573766
    C_0004662975987075955962 --> C_0002027120791438508115
    C_0004662975987075955962 --> C_0010044431027817489945
    C_0004662975987075955962 --> C_0006672437125610379356
    C_0004662975987075955962 --> C_0008063967914262038647
    C_0004662975987075955962 --> C_0009014951225837961074
    C_0004662975987075955962 --> C_0012389142519446737106
    C_0004662975987075955962 --> C_0017998885070914382401
    C_0004662975987075955962 --> C_0011687987665606014223
    C_0004662975987075955962 --> C_0011066283835893554674
    C_0004662975987075955962 --> C_0000415219272604096448
    C_0004662975987075955962 --> C_0015919083400246773521
    C_0000683983954371703321 --> C_0005021643397729925023
    C_0009705104522813573766 --> C_0000683983954371703321
    C_0009705104522813573766 --> C_0005021643397729925023
    C_0002027120791438508115 --> C_0000683983954371703321
    C_0002027120791438508115 --> C_0005021643397729925023
    C_0010044431027817489945 --> C_0000683983954371703321
    C_0010044431027817489945 --> C_0005021643397729925023
    C_0006672437125610379356 --> C_0000683983954371703321
    C_0006672437125610379356 --> C_0005021643397729925023
    C_0008063967914262038647 --> C_0000683983954371703321
    C_0008063967914262038647 --> C_0005021643397729925023
    C_0009014951225837961074 --> C_0000683983954371703321
    C_0009014951225837961074 --> C_0005021643397729925023
    C_0012389142519446737106 --> C_0000683983954371703321
    C_0012389142519446737106 --> C_0005021643397729925023
    C_0017998885070914382401 --> C_0000683983954371703321
    C_0017998885070914382401 --> C_0005021643397729925023
    C_0011687987665606014223 --> C_0000683983954371703321
    C_0011687987665606014223 --> C_0005021643397729925023
    C_0011066283835893554674 --> C_0000683983954371703321
    C_0011066283835893554674 --> C_0005021643397729925023
    C_0000415219272604096448 --> C_0000683983954371703321
    C_0000415219272604096448 --> C_0005021643397729925023
    C_0015919083400246773521 --> C_0000683983954371703321
    C_0015919083400246773521 --> C_0005021643397729925023
    C_0005021643397729925023 --> C_0012871275894220828006
    C_0016013798473120276547 --> C_0012871275894220828006
    C_0010016149012892003898 --> C_0005021643397729925023

%% Generated with clang-uml, version 0.5.3
%% LLVM version clang version 18.1.1 (https://github.com/llvm/llvm-project.git dba2a75e9c7ef81fe84774ba5eee5e67e01d801a)
