docs/diagrams/include_diagram.puml
@startuml
folder "src" as C_0009392701334512935369 {
folder "serverModule" as C_0000376844742298738572 {
file "serverhandler.cpp" as C_0002802959985742540062
file "serverhandler.h" as C_0014776125144863485891
file "server.h" as C_0004930444100045331493
file "server.cpp" as C_0014526408463163538724
}
folder "requestModule" as C_0007249139127462911352 {
file "RequestManager.h" as C_0004662975987075955962
folder "Requests" as C_0001482322031337363986 {
file "Request.h" as C_0000683983954371703321
file "LoginRequest.h" as C_0009705104522813573766
file "GetAccountNumberRequest.h" as C_0002027120791438508115
file "GetBalanceRequest.h" as C_0010044431027817489945
file "GetTransactionsHistoryRequest.h" as C_0006672437125610379356
file "MakeTransactionRequest.h" as C_0008063967914262038647
file "GetDatabaseRequest.h" as C_0009014951225837961074
file "CreateNewUserRequest.h" as C_0012389142519446737106
file "DeleteUserRequest.h" as C_0017998885070914382401
file "UpdateUserRequest.h" as C_0011687987665606014223
file "UserInitRequest.h" as C_0011066283835893554674
file "UpdateEmailRequest.h" as C_0000415219272604096448
file "UpdatePasswordRequest.h" as C_0015919083400246773521
}
}
folder "dbModule" as C_0006877198409089665649 {
file "db.h" as C_0005021643397729925023
file "dbresult.h" as C_0012871275894220828006
file "dbresult.cpp" as C_0016013798473120276547
file "db.cpp" as C_0010016149012892003898
}
}
C_0002802959985742540062 --> C_0014776125144863485891
C_0014776125144863485891 --> C_0004662975987075955962
C_0004930444100045331493 --> C_0014776125144863485891
C_0014526408463163538724 --> C_0004930444100045331493
C_0004662975987075955962 --> C_0000683983954371703321
C_0004662975987075955962 --> C_0009705104522813573766
C_0004662975987075955962 --> C_0002027120791438508115
C_0004662975987075955962 --> C_0010044431027817489945
C_0004662975987075955962 --> C_0006672437125610379356
C_0004662975987075955962 --> C_0008063967914262038647
C_0004662975987075955962 --> C_0009014951225837961074
C_0004662975987075955962 --> C_0012389142519446737106
C_0004662975987075955962 --> C_0017998885070914382401
C_0004662975987075955962 --> C_0011687987665606014223
C_0004662975987075955962 --> C_0011066283835893554674
C_0004662975987075955962 --> C_0000415219272604096448
C_0004662975987075955962 --> C_0015919083400246773521
C_0000683983954371703321 --> C_0005021643397729925023
C_0009705104522813573766 --> C_0000683983954371703321
C_0009705104522813573766 --> C_0005021643397729925023
C_0002027120791438508115 --> C_0000683983954371703321
C_0002027120791438508115 --> C_0005021643397729925023
C_0010044431027817489945 --> C_0000683983954371703321
C_0010044431027817489945 --> C_0005021643397729925023
C_0006672437125610379356 --> C_0000683983954371703321
C_0006672437125610379356 --> C_0005021643397729925023
C_0008063967914262038647 --> C_0000683983954371703321
C_0008063967914262038647 --> C_0005021643397729925023
C_0009014951225837961074 --> C_0000683983954371703321
C_0009014951225837961074 --> C_0005021643397729925023
C_0012389142519446737106 --> C_0000683983954371703321
C_0012389142519446737106 --> C_0005021643397729925023
C_0017998885070914382401 --> C_0000683983954371703321
C_0017998885070914382401 --> C_0005021643397729925023
C_0011687987665606014223 --> C_0000683983954371703321
C_0011687987665606014223 --> C_0005021643397729925023
C_0011066283835893554674 --> C_0000683983954371703321
C_0011066283835893554674 --> C_0005021643397729925023
C_0000415219272604096448 --> C_0000683983954371703321
C_0000415219272604096448 --> C_0005021643397729925023
C_0015919083400246773521 --> C_0000683983954371703321
C_0015919083400246773521 --> C_0005021643397729925023
C_0005021643397729925023 --> C_0012871275894220828006
C_0016013798473120276547 --> C_0012871275894220828006
C_0010016149012892003898 --> C_0005021643397729925023

'Generated with clang-uml, version 0.5.3
'LLVM version clang version 18.1.1 (https://github.com/llvm/llvm-project.git dba2a75e9c7ef81fe84774ba5eee5e67e01d801a)
@enduml
